# Pandas

1) Creat Series
2) Explore Data
3) Manipulate Index
4) Create Series Using Dictionary
5) Concatenate Series
6) Manipulate Data
7) Search Record in Data
8) Search Record with Fancy Index
9) Create DataFrames
10) Manipulate DataFrames
11) Conditional Operations in DataFrames
12) Select Subset Data using .loc / .iloc in DataFrames
13) Joins
14) Grouping
15) Summarizing
16) Pivot Table

In [1]:
import pandas as pd
import numpy as np

## 1. Create Serries

In [2]:
seri = pd.Series([1,2,3,4,5]) # Index is kept in data in Pandas pandas.

## 2. Explore Data

In [3]:
type(seri)

pandas.core.series.Series

In [4]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [5]:
seri.dtype

dtype('int64')

In [6]:
seri.size

5

In [7]:
seri.ndim

1

In [8]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [9]:
seri.head(3)

0    1
1    2
2    3
dtype: int64

In [10]:
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [11]:
num = np.array([99,22,33,95,5])

pd.Series(num)

0    99
1    22
2    33
3    95
4     5
dtype: int32

## 3. Manipulate Index

In [12]:
pd.Series(num, index = [1,3,5,7,9])

1    99
3    22
5    33
7    95
9     5
dtype: int32

In [13]:
pd.Series([99,22,33,95,5], index = [1,3,5,7,9]) # same as above

1    99
3    22
5    33
7    95
9     5
dtype: int64

In [14]:
pd.Series([99,22,33,95,5], index = ["a","b",5,7,9])

a    99
b    22
5    33
7    95
9     5
dtype: int64

In [15]:
seri = pd.Series([99,22,33,95,5], index = ["a","b","c","d","e"])
seri

a    99
b    22
c    33
d    95
e     5
dtype: int64

In [16]:
seri["a":"c"]

a    99
b    22
c    33
dtype: int64

## 4. Creat Series using Dictionaries

In [17]:
dict = pd.Series({"reg":10, "log":11, "cart":12})
dict

reg     10
log     11
cart    12
dtype: int64

In [18]:
dict1 = {"reg":10, "log":11, "cart":12}
seri = pd.Series(dict1)
seri

reg     10
log     11
cart    12
dtype: int64

## 5. Concatenate Series

In [19]:
pd.concat([dict, seri], axis=1)

       0   1
reg   10  10
log   11  11
cart  12  12

In [20]:
pd.concat([dict, seri], axis=0) # axis=0 is by default

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

## 6. Manipulate Data

In [21]:
a = np.array([11,22,33,44,55])
seri = pd.Series(a)
seri

0    11
1    22
2    33
3    44
4    55
dtype: int32

In [22]:
seri[2]

33

In [23]:
seri[:3]

0    11
1    22
2    33
dtype: int32

In [24]:
seri = pd.Series([121, 232, 343, 454], index =["reg", "log", "cart", "rf"])
seri

reg     121
log     232
cart    343
rf      454
dtype: int64

In [25]:
seri.index

Index(['reg', 'log', 'cart', 'rf'], dtype='object')

In [26]:
seri.values

array([121, 232, 343, 454], dtype=int64)

In [27]:
seri.keys

<bound method Series.keys of reg     121
log     232
cart    343
rf      454
dtype: int64>

In [28]:
list(seri.items())

[('reg', 121), ('log', 232), ('cart', 343), ('rf', 454)]

## 7. Search Record in Data

In [29]:
"reg" in seri

True

In [30]:
"a" in seri

False

In [31]:
seri["reg"]

121

## 8. Search Record with Fancy Index

In [32]:
seri[["rf", "reg"]]

rf     454
reg    121
dtype: int64

In [33]:
seri["reg"] =220
seri

reg     220
log     232
cart    343
rf      454
dtype: int64

In [34]:
seri["reg":"cart"]

reg     220
log     232
cart    343
dtype: int64

## 9. Create DataFrames

In [35]:
l = [1,2,34, 45,67]
l

[1, 2, 34, 45, 67]

In [36]:
pd.DataFrame(l,columns =["var_title"])

   var_title
0          1
1          2
2         34
3         45
4         67

- Convert Array into DataFrame

In [37]:
a = np.array([1,2,3,4,5])
pd.DataFrame(a, columns =["var1"])

   var1
0     1
1     2
2     3
3     4
4     5

In [38]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [39]:
df=pd.DataFrame(m, columns=["var1", "var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

- Convert DataFrame into Array

In [40]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

- Change Column Names

In [41]:
df.columns = ["a","b","c"]
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
 df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['a', 'b', 'c'], dtype='object')]

In [44]:
df.ndim

2

In [45]:
df.size

9

## 10. Manipulate DataFrame

In [46]:
s1 = np.random.randint(10, size =5)
s2 = np.random.randint(10, size =5)
s3 = np.random.randint(10, size =5)

In [47]:
dict = {"var1":s1, "var2":s2, "var3":s3}
dict

{'var1': array([8, 8, 1, 2, 2]),
 'var2': array([3, 8, 3, 3, 0]),
 'var3': array([1, 5, 9, 2, 9])}

In [48]:
df = pd.DataFrame(dict)
df

   var1  var2  var3
0     8     3     1
1     8     8     5
2     1     3     9
3     2     3     2
4     2     0     9

In [49]:
df[0:1]

   var1  var2  var3
0     8     3     1

In [50]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [51]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     8     3     1
b     8     8     5
c     1     3     9
d     2     3     2
e     2     0     9

In [52]:
df["b":"d"]

   var1  var2  var3
b     8     8     5
c     1     3     9
d     2     3     2

- Remove Row From DataFrame : axis=0

In [53]:
df.drop(["a"], axis=0)

   var1  var2  var3
b     8     8     5
c     1     3     9
d     2     3     2
e     2     0     9

- Remove Column from DataFrame : axis=1

In [54]:
df.drop(["var1"], axis=1)

   var2  var3
a     3     1
b     8     5
c     3     9
d     3     2
e     0     9

- Remove Data using Fancy

In [55]:
l = ["c","d"]
df.drop(l, axis=0)

   var1  var2  var3
a     8     3     1
b     8     8     5
e     2     0     9

- Search data in DataFrame

In [56]:
"var1" in df

True

In [57]:
l =["var1", "var2", "var4"]

for i in l:
    print(i in df)

True
True
False

In [58]:
df["var1"]

a    8
b    8
c    1
d    2
e    2
Name: var1, dtype: int32

- Add a New Column

In [59]:
df["var4"] = df["var1"]*df["var2"]
df

   var1  var2  var3  var4
a     8     3     1    24
b     8     8     5    64
c     1     3     9     3
d     2     3     2     6
e     2     0     9     0

## 11. Conditional Operations in DataFrame

In [60]:
df[0:2]["var1"]

a    8
b    8
Name: var1, dtype: int32

In [61]:
df["var1"]>4

a     True
b     True
c    False
d    False
e    False
Name: var1, dtype: bool

In [62]:
df[df["var1"]>4]

   var1  var2  var3  var4
a     8     3     1    24
b     8     8     5    64

In [63]:
df[df["var1"]>4]["var2"]

a    3
b    8
Name: var2, dtype: int32

In [64]:
(df["var1"]>4) & (df["var2"]==3) # We must definitely use paranthesis if we use multiple conditions.

a     True
b    False
c    False
d    False
e    False
dtype: bool

In [65]:
df[(df["var1"]>4) & (df["var2"]==3)]

   var1  var2  var3  var4
a     8     3     1    24

In [66]:
df[(df["var1"]>4) & (df["var2"]==3)]["var4"]

a    24
Name: var4, dtype: int32

## 12. Select Subset Data using .loc / .iloc in DataFrames

- loc = location \
- iloc= index location

In [67]:
df[df["var1"]>4][["var2","var3"]]

   var2  var3
a     3     1
b     8     5

In [68]:
df.loc[df["var1"]>4, ["var2","var3"]] # same as above

   var2  var3
a     3     1
b     8     5

In [69]:
df

   var1  var2  var3  var4
a     8     3     1    24
b     8     8     5    64
c     1     3     9     3
d     2     3     2     6
e     2     0     9     0

In [70]:
df.iloc[1] # select row

var1     8
var2     8
var3     5
var4    64
Name: b, dtype: int32

In [71]:
df.iloc[1,3] # select opint

64

In [72]:
df.iloc[-1] # select the last row

var1    2
var2    0
var3    9
var4    0
Name: e, dtype: int32

In [73]:
df.iloc[:,0] # select column

a    8
b    8
c    1
d    2
e    2
Name: var1, dtype: int32

In [74]:
df.iloc[0:2,1:3]

   var2  var3
a     3     1
b     8     5

In [75]:
df.iloc[0:2,1:3]["var3"]

a    1
b    5
Name: var3, dtype: int32

## 13. JOINS

In [76]:
m = np.random.randint(1,30, size=(5,3))
df1 = pd.DataFrame(m, columns= ["var1","var2","var3"])
df1

   var1  var2  var3
0    27     3     2
1    14    22    24
2    12    12    20
3    10    18    22
4    13    20    28

In [77]:
df1 = pd.DataFrame(m, columns= ["var1","var2","var3"])
df1

   var1  var2  var3
0    27     3     2
1    14    22    24
2    12    12    20
3    10    18    22
4    13    20    28

In [78]:
df2 = df1+99
df2

   var1  var2  var3
0   126   102   101
1   113   121   123
2   111   111   119
3   109   117   121
4   112   119   127

In [79]:
pd.concat([df1,df2], axis=1)

   var1  var2  var3  var1  var2  var3
0    27     3     2   126   102   101
1    14    22    24   113   121   123
2    12    12    20   111   111   119
3    10    18    22   109   117   121
4    13    20    28   112   119   127

In [80]:
pd.concat([df1,df2]) # axis=0 by default

   var1  var2  var3
0    27     3     2
1    14    22    24
2    12    12    20
3    10    18    22
4    13    20    28
0   126   102   101
1   113   121   123
2   111   111   119
3   109   117   121
4   112   119   127

- solve he index issue

In [81]:
pd.concat([df1,df2], ignore_index = True)

   var1  var2  var3
0    27     3     2
1    14    22    24
2    12    12    20
3    10    18    22
4    13    20    28
5   126   102   101
6   113   121   123
7   111   111   119
8   109   117   121
9   112   119   127

- change columns name and concatenate again

In [82]:
df2.columns = ["var1","var2","John"]

In [83]:
pd.concat([df1,df2])

   var1  var2  var3   John
0    27     3   2.0    NaN
1    14    22  24.0    NaN
2    12    12  20.0    NaN
3    10    18  22.0    NaN
4    13    20  28.0    NaN
0   126   102   NaN  101.0
1   113   121   NaN  123.0
2   111   111   NaN  119.0
3   109   117   NaN  121.0
4   112   119   NaN  127.0

- select join type

In [84]:
pd.concat([df1,df2], join="inner")

   var1  var2
0    27     3
1    14    22
2    12    12
3    10    18
4    13    20
0   126   102
1   113   121
2   111   111
3   109   117
4   112   119

In [85]:
?pd.concat

Signature:
pd.concat(
    objs: Union[Iterable[Union[ForwardRef('DataFrame'), ForwardRef('Series')]], Mapping[Union[Hashable, NoneType], Union[ForwardRef('DataFrame'), ForwardRef('Series')]]],
    axis=0,
    join='outer',
    ignore_index: bool = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: bool = False,
    sort: bool = False,
    copy: bool = True,
) -> Union[ForwardRef('DataFrame'), ForwardRef('Series')]
Docstring:
Concatenate pandas objects along a particular axis with optional set logic
along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a dict is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned when `join`
    is 'outer'.
    This has no effect when ``join='inner'``, which already preserves
    the order of the non-concatenation axis.

    .. versionadded:: 0.23.0
    .. versionchanged:: 1.0.0

       Changed to not sort by default.

copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
Series.append : Concatenate Series.
DataFrame.append : Concatenate DataFrames.
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

***Advanced Join Operation*** \
-merge()

In [86]:
emp_dept = {"employees":["John","Smith","Mary","Joe"],"departments":["Finance","Engineering","Sales","HR"]}
emp_date={"employees":["John", "Smith", "Mary", "Joe"],"start_date":[2010, 2009, 2014, 2019]}

df1=pd.DataFrame(emp_dept)
df2=pd.DataFrame(emp_date)

In [87]:
pd.merge(df1,df2)

  employees  departments  start_date
0      John      Finance        2010
1     Smith  Engineering        2009
2      Mary        Sales        2014
3       Joe           HR        2019

In [88]:
# many to one

df3 = pd.merge(df1,df2, on='employees')
df3

  employees  departments  start_date
0      John      Finance        2010
1     Smith  Engineering        2009
2      Mary        Sales        2014
3       Joe           HR        2019

In [89]:
managers= {"manager":["Alexa","Siri","Lena"], "departments":["Finance", "Engineering","HR"]} # no Sales here!!

df4 =pd.DataFrame(managers)
df4

  manager  departments
0   Alexa      Finance
1    Siri  Engineering
2    Lena           HR

In [90]:
pd.merge(df3,df4)

  employees  departments  start_date manager
0      John      Finance        2010   Alexa
1     Smith  Engineering        2009    Siri
2       Joe           HR        2019    Lena

In [91]:
# many to many

tools = {"departments":["Finance","Finance", "Engineering","Engineering","HR","HR"], "capacities":["math", "excel", "coding","linux","excel","agile"]}

df5=pd.DataFrame(tools)
df5

   departments capacities
0      Finance       math
1      Finance      excel
2  Engineering     coding
3  Engineering      linux
4           HR      excel
5           HR      agile

In [92]:
pd.merge(df1,df5)

  employees  departments capacities
0      John      Finance       math
1      John      Finance      excel
2     Smith  Engineering     coding
3     Smith  Engineering      linux
4       Joe           HR      excel
5       Joe           HR      agile

## 14.GROUPING

***most important functions of Pandas***

* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

- We will use the sample data of seaborn library below

In [93]:
import seaborn as sns

In [94]:
?sns.load_dataset

Signature: sns.load_dataset(name, cache=True, data_home=None, **kws)
Docstring:
Load a dataset from the online repository (requires internet).

Parameters
----------
name : str
    Name of the dataset (`name`.csv on
    https://github.com/mwaskom/seaborn-data).  You can obtain list of
    available datasets using :func:`get_dataset_names`
cache : boolean, optional
    If True, then cache data locally and use the cache on subsequent calls
data_home : string, optional
    The directory in which to cache data. By default, uses ~/seaborn-data/
kws : dict, optional
    Passed to pandas.read_csv
File:      c:\users\user\anaconda3\lib\site-packages\seaborn\utils.py
Type:      function

In [95]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [97]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [98]:
df["mass"].mean()

2.6381605847953233

In [99]:
df.mass.count() # same as df["mass"].count()

513

In [100]:
df["mass"].min()

0.0036

In [101]:
df["mass"].std()

3.8186166509616046

In [102]:
df["mass"].var()

14.58183312700122

In [103]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [104]:
df.isnull().sum()

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [105]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

- ***Groupby()***

In [106]:
df = pd.DataFrame({ "group":["A","B","C","A","B","C"],
                  "data":[10,11,52,23,43,55]})
df

  group  data
0     A    10
1     B    11
2     C    52
3     A    23
4     B    43
5     C    55

In [107]:
df.groupby("group")

In [108]:
df.groupby("group").mean()

       data
group
A      16.5
B      27.0
C      53.5

In [109]:
df.groupby("group").sum()

       data
group
A        33
B        54
C       107

In [110]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [111]:
df.groupby("method").count()

                               number  orbital_period  mass  distance  year
method
Astrometry                          2               2     0         2     2
Eclipse Timing Variations           9               9     2         4     9
Imaging                            38              12     0        32    38
Microlensing                       23               7     0        10    23
Orbital Brightness Modulation       3               3     0         2     3
Pulsar Timing                       5               5     0         1     5
Pulsation Timing Variations         1               1     0         0     1
Radial Velocity                   553             553   510       530   553
Transit                           397             397     1       224   397
Transit Timing Variations           4               3     0         3     4

In [112]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [113]:
df.groupby("method")["orbital_period","mass"].mean()

C:\Users\User\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                               orbital_period      mass
method
Astrometry                         631.180000       NaN
Eclipse Timing Variations         4751.644444  5.125000
Imaging                         118247.737500       NaN
Microlensing                      3153.571429       NaN
Orbital Brightness Modulation        0.709307       NaN
Pulsar Timing                     7343.021201       NaN
Pulsation Timing Variations       1170.000000       NaN
Radial Velocity                    823.354680  2.630699
Transit                             21.102073  1.470000
Transit Timing Variations           79.783500       NaN

In [114]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## 15. SUMMARIZING

* <b>aggregate() / filter() / transform() / apply()<b/>
    
   ( group by + summarize )

In [115]:
df = pd.DataFrame({ "groups":["A","B","C","A","B","C"],
                  "data1":[10,11,52,23,43,55],
                  "data2":[100,253,33,262,11,969]}, columns = ["groups","data1","data2"])
df

  groups  data1  data2
0      A     10    100
1      B     11    253
2      C     52     33
3      A     23    262
4      B     43     11
5      C     55    969

* <b>aggregate()<b/>

In [116]:
df.groupby("groups").aggregate([min, np.mean, np.median, "max"]) # pandas functions can run with quotes or without quotes

       data1                  data2
         min  mean median max   min mean median  max
groups
A         10  16.5   16.5  23   100  181    181  262
B         11  27.0   27.0  43    11  132    132  253
C         52  53.5   53.5  55    33  501    501  969

In [117]:
df.groupby("groups").aggregate({"data1":np.mean, 
                                "data2":np.mean})

        data1  data2
groups
A        16.5    181
B        27.0    132
C        53.5    501

* <b>filter()<b/>

In [118]:
def filter_func(a):
    return a["data1"].std()>9

In [119]:
df.groupby("groups").filter(filter_func)

  groups  data1  data2
0      A     10    100
1      B     11    253
3      A     23    262
4      B     43     11

* <b>transform()<b/>

In [120]:
df_sub = df.iloc[:,1:3]
df_sub

   data1  data2
0     10    100
1     11    253
2     52     33
3     23    262
4     43     11
5     55    969

In [121]:
df_sub.transform(lambda x: np.sqrt(x-x.mean()/x.std()))

      data1      data2
0  2.899180   9.962040
1  3.066797  15.882136
2  7.099665   5.678226
3  4.626580  16.162990
4  6.434691   3.200351
5  7.307889  31.116591

* <b>apply()<b/>

In [122]:
df_sub.apply(np.sum)

data1     194
data2    1628
dtype: int64

In [123]:
df

  groups  data1  data2
0      A     10    100
1      B     11    253
2      C     52     33
3      A     23    262
4      B     43     11
5      C     55    969

In [124]:
df.groupby("groups")["data1",'data2'].apply(np.sum)

C:\Users\User\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

        data1  data2
groups
A          33    362
B          54    264
C         107   1002

In [125]:
df.groupby("groups").apply(np.mean)

        data1  data2
groups
A        16.5  181.0
B        27.0  132.0
C        53.5  501.0

## 16. Pivot Table 

- <b>pivot_table()<b/>

In [138]:
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [127]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [128]:
# double bracet makes it DataFrame

titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [129]:
titanic.groupby(["sex","class"])["survived"].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [130]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean") # same as above

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [131]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean").unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

- Let's do the same operation with <b>pivot_table()<b/>
    
    <i>it will be easier!<i/>

In [132]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Let's make 3 age group and summarize with pivot_table.

In order to segment, ***cut()*** function will be utilized

In [133]:
titanic["age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [143]:
age = pd.cut(titanic["age"],[0, 18, 40, 90])
age.head()

0    (18, 40]
1    (18, 40]
2    (18, 40]
3    (18, 40]
4    (18, 40]
Name: age, dtype: category
Categories (3, interval[int64]): [(0, 18] < (18, 40] < (40, 90]]

In [135]:
titanic.pivot_table("survived", index=["sex",age], columns="class") # age will not have qoute for not the column of titanic dataset.

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 40]  0.979167  0.914894  0.480000
       (40, 90]  0.961538  0.846154  0.111111
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 40]  0.478261  0.063492  0.146199
       (40, 90]  0.280000  0.095238  0.064516

In [136]:
?df.pivot_table

Signature:
df.pivot_table(
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
) -> 'DataFrame'
Docstring:
Create a spreadsheet-style pivot table as a DataFrame.

The levels in the pivot table will be stored in MultiIndex objects
(hierarchical indexes) on the index and columns of the result DataFrame.

Parameters
----------
values : column to aggregate, optional
index : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table index.  If an array is passed,
    it is being used as the same manner as column values.
columns : column, Grouper, array, or list of the previous
    If an array is passed, it must be the same length as the data. The
    list can contain any of the other types (except list).
    Keys to group by on the pivot table column.  If an array is passed,
    it is being used as the same manner as column values.
aggfunc : function, list of functions, dict, default numpy.mean
    If list of functions passed, the resulting pivot table will have
    hierarchical columns whose top level are the function names
    (inferred from the function objects themselves)
    If dict is passed, the key is column to aggregate and value
    is function or list of functions.
fill_value : scalar, default None
    Value to replace missing values with.
margins : bool, default False
    Add all row / columns (e.g. for subtotal / grand totals).
dropna : bool, default True
    Do not include columns whose entries are all NaN.
margins_name : str, default 'All'
    Name of the row / column that will contain the totals
    when margins is True.
observed : bool, default False
    This only applies if any of the groupers are Categoricals.
    If True: only show observed values for categorical groupers.
    If False: show all values for categorical groupers.

    .. versionchanged:: 0.25.0

Returns
-------
DataFrame
    An Excel style pivot table.

See Also
--------
DataFrame.pivot : Pivot without aggregation that can handle
    non-numeric data.

Examples
--------
>>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
...                          "bar", "bar", "bar", "bar"],
...                    "B": ["one", "one", "one", "two", "two",
...                          "one", "one", "two", "two"],
...                    "C": ["small", "large", "large", "small",
...                          "small", "large", "small", "small",
...                          "large"],
...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
>>> df
     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

This first example aggregates values by taking the sum.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum)
>>> table
C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

We can also fill missing values using the `fill_value` parameter.

>>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
...                     columns=['C'], aggfunc=np.sum, fill_value=0)
>>> table
C        large  small
A   B
bar one      4      5
    two      7      6
foo one      4      1
    two      0      6

The next example aggregates by taking the mean across multiple columns.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': np.mean})
>>> table
                D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

We can also calculate multiple types of aggregations for any given
value column.

>>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
...                     aggfunc={'D': np.mean,
...                              'E': [min, max, np.mean]})
>>> table
                D    E
            mean  max      mean  min
A   C
bar large  5.500000  9.0  7.500000  6.0
    small  5.500000  9.0  8.500000  8.0
foo large  2.000000  5.0  4.500000  4.0
    small  2.333333  6.0  4.333333  2.0
File:      c:\users\user\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method